#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/FIAP-Lanchonete-G41/tech-challenge-fase-3-iac/runs/run-7zmWhjfL54ConVRj

Waiting for the plan to start...

Terraform v1.10.2
on linux_amd64
Initializing plugins and modules...
module.db_password_secret.aws_secretsmanager_secret.this: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:721525683170:secret:db-password-wAVJzr]
module.lanchonete_vpc.aws_vpc.this: Refreshing state... [id=vpc-01ccebb8e1173efa6]
module.db_password_secret.aws_secretsmanager_secret_version.this: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:721525683170:secret:db-password-wAVJzr|terraform-20241215204947233100000002]
module.lanchonete_db_private_subnet_a.aws_subnet.this: Refreshing state... [id=subnet-0a18b603050194fdf]
module.lanchonete_db_private_subnet_b.aws_subnet.this: Refreshing state... [id=subnet-066ded97972d280f4]
module.lanchonete_rds_sg.aws_security_group.this: Refreshing state... [id=sg-078fb7125dda17dc5]
module.lanchonete_rds.aws_db_subnet_group.this: Refreshing state... [id=lanchonete-subnet-group]
module.lanchonete_rds.aws_db_instance.this: Refreshing state... [id=db-CDPODJYGLX2RS2BVFH3BIF4FPM]
module.lanchonete_rds.aws_db_instance.this: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.lanchonete_http_api.aws_apigatewayv2_api.this will be created
  + resource "aws_apigatewayv2_api" "this" {
      + api_endpoint                 = (known after apply)
      + api_key_selection_expression = "$request.header.x-api-key"
      + arn                          = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + name                         = "lanchonete-http-api"
      + protocol_type                = "HTTP"
      + route_selection_expression   = "$request.method $request.path"
      + tags_all                     = (known after apply)

      + cors_configuration {}
    }

  # module.lanchonete_http_api.aws_apigatewayv2_stage.this will be created
  + resource "aws_apigatewayv2_stage" "this" {
      + api_id        = (known after apply)
      + arn           = (known after apply)
      + auto_deploy   = true
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + name          = "$default"
      + tags_all      = (known after apply)

      + default_route_settings {
          + data_trace_enabled       = false
          + detailed_metrics_enabled = false
          + logging_level            = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @rafaelvmasc, Action: `pull_request`*